In [3]:
import pandas as pd

In [4]:
dicionario_01 = {
    'A': [1,2,3],
    'B': [-32,-21,-15],
    'C': [60,10,20],
    'Chave': ['AA','BB','CC']
}
dicionario_02 = {
    'A': [6,7,8],
    'B': [-39,-28,-17],
    'C': [1000,10,60],
    'Chave': ['AA','BB','CC']
}
dicionario_03 = {
    'A': [9,10,11],
    'B': [-39,-22,-17],
    'C': [30,10,20],
    'Chave': ['AA','BB','CC']
}
label_01 = ['1ª linha ','2ª linha','3ª linha']
label_02 = ['4ª linha ','5ª linha','6ª linha']
label_03 = ['7ª linha ','8ª linha','9ª linha']

In [5]:
#Criando DataFrame
df1 = pd.DataFrame(dicionario_01,index=label_01)
df2 = pd.DataFrame(dicionario_02,index=label_02)
df3 = pd.DataFrame(dicionario_03,index=label_03)

In [8]:
df1.head()

           A   B   C Chave
1ª linha   1 -32  60    AA
2ª linha   2 -21  10    BB
3ª linha   3 -15  20    CC

In [9]:
df2.head()

           A   B     C Chave
4ª linha   6 -39  1000    AA
5ª linha   7 -28    10    BB
6ª linha   8 -17    60    CC

In [10]:
df3.head()

            A   B   C Chave
7ª linha    9 -39  30    AA
8ª linha   10 -22  10    BB
9ª linha   11 -17  20    CC

In [13]:
#Juntando datasframes utilizando o "concast" = comando que empilha as dataframes
df_n = pd.concat([df1,df2,df3])

In [14]:
df_n.head()

           A   B     C Chave
1ª linha   1 -32    60    AA
2ª linha   2 -21    10    BB
3ª linha   3 -15    20    CC
4ª linha   6 -39  1000    AA
5ª linha   7 -28    10    BB

In [15]:
#Une os dataframes com o "merge" = 
#inner verefica se a chave está em ambos os dataframes
df_n2 = pd.merge(df1,df2,how='inner', on='Chave')

In [16]:
df_n2.head()

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [17]:

df_n3 = pd.merge(df1,df3,how='right', on='Chave')

In [18]:
df_n3.head()

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA    9  -39   30
1    2  -21   10    BB   10  -22   10
2    3  -15   20    CC   11  -17   20

In [19]:
Dic01 = {
     'A': [1,2,3],
    'B': [-32,-21,-15],
    'C': [60,10,20]
}
Dic02 = {
     'D': [6,7,8],
    'E': [-39,-38,-17],
    'F': [1000,10,60]
}
label01 = ['1ª linha ','2ª linha','3ª linha'] #Cria o label
dataframe01 = pd.DataFrame(Dic01, index=label01)
dataframe02 = pd.DataFrame(Dic02, index=label01)

In [20]:
dataframe01.head()

           A   B   C
1ª linha   1 -32  60
2ª linha   2 -21  10
3ª linha   3 -15  20

In [21]:
dataframe02.head()

           D   E     F
1ª linha   6 -39  1000
2ª linha   7 -38    10
3ª linha   8 -17    60

In [22]:
#Junta os 2 dataframes usando "join" = junta os 2.
dataframe01.join(dataframe02)

           A   B   C  D   E     F
1ª linha   1 -32  60  6 -39  1000
2ª linha   2 -21  10  7 -38    10
3ª linha   3 -15  20  8 -17    60